"use strict";

// =============================================================
// приклад використання confirm, prompt, створення та додавання елементу на сторінку для проведення якогось опитування


// Використовуємо confirm для отримання відповіді користувача на питання "Вам сподобався урок"
let confirmAnswer = confirm("Вам сподобались нотатки до уроку?");

// оголошення змінної userResponse для збереження відповіді
let userResponse
// Якщо користувач відповів "так" на питання "Вам сподобався урок?"
if (confirmAnswer === true) {
  // Показуємо сповіщення, що ми раді, що урок сподобався користувачу
  alert("Я радий, що вам сподобались нотатки до уроку 🥰")
} else {
  // Якщо користувач відповів "ні" (кнопка скасувати), ми просимо його вказати, що саме йому не сподобалось
  userResponse = prompt("Вкажіть, що саме вам не сподобалось та що б ви додали 🤔")

  // Перевіряємо чи користувач ввів відгук, якщо він його ввів то відображаємо повідомлення
  if (userResponse !== null && userResponse.trim() !== "") {
    // Показуємо сповіщення, що ми дякуємо за відгук користувача
    alert("Дякуємо за ваш відгук, ми працюємо над покращенням 🤩")

    // оголошуємо змінну responceText в якій створюємо елемент 
    let responceText = document.createElement('div');

    // Додаємо клас 'page__responce' до створеного елемента
    responceText.classList.add('page__responce');

    // додаємо всередину створеного елементу ще один елемент параграф в який будемо виводити відповідь користувача
    responceText.innerHTML = `<p>Ваша відповідь: <span>${userResponse}</span></p>`;

    // знаходимо елемент до якого будемо додавати новий елемент
    const pageContainer = document.querySelector('.page__container');

    // додаємо створенй елемент в page__container
    pageContainer.append(responceText);
  }
}
